{
    "datemade" : "2/18/21",
    "description" : "At the very start of the pandemic I started getting really into coding the first project that started this coind journey was a dice probobility calculator. I was playing DND and was amazed by how probobility worked and how rolling dice probabilityies worked. After reading about how probobilities worked I wanted an easy way to calculate it in my games of DND, so i decided to try to use a skill that i had not used in a while: Coding in python. I still renembered some of the basic syntax, and the basics of coding ( such as for and if loops), but did not know much. Luckely this was a faily easy project and just required some simple computations. Some of the stepps were unnessisary such as finding all probabilities of the dice roles then counting how many times each offurance happened. Instead i could have just plugged in some formulas such as the one at this link: https://uploads-cdn.omnicalculator.com/images/dice_probability_exact_sum.gif. And repeated the calculation for each side of the dice. I did not do this though becasue even though that is what runs fastest on a computer that is not how humans think about probability. I coded the way that made scence, by calculating every single combination that could happen on the dice. I used this project in my life and it was a good starting project and tought my the fundimentals of coding and some math and probability.",
    "github" : "https://github.com/seesi8/dice",
    "imgurl" : "https://firebasestorage.googleapis.com/v0/b/portfolio-dedd9.appspot.com/o/b44d796a-9285-4ac8-9d5e-207c17673edf?alt=media&token=f80efd01-9f58-43db-9dc8-fe10192d7e8d",
    "title" : "Webstite that uses predictive modeling to find arbitrage in video game market that was built using pure js and html with a Node.js background",
    "tldr" : "Back in the early days of the pandemic i created a probability calculator using python. It was inspired by me playing DND wich is a very dice based game and relies alot on probability. This is not made to be fast, but it was programmed as a way for me to be able to understnad probability and learn about the fundimentals of coding. The livedemo is to a google colab of the code.",
    "livedemo" : "https://colab.research.google.com/drive/1qG7FMz3qjl2v8zOkIVL0jLCzx4rUEcY-?usp=sharing"
}