{
    "datemade" : "7/3/22",
    "description" : "At the start of quarentine I started sitting at my computer alot more (and coding alot more), so I wanted a standing desk, but i did'nt just want any standing desk. I wanted to build my own. I descovered linear actuators, so to my younger mind it seemed as easy as strapping two accutators to the side of a desk and adding power, but it was not that easy. For example at first i needed to build a table that could move up and down. Because I did not think that the accutators were not stable enough to support the table by itself I needed strong thick moveable legs (which ended up being 100% nessisary). I used the original legs for a table I had and strapped some cabnet sliders (to combine the two pices while still amking it able to move) to the side of the legs. I then made a wooden box that would fit outisde of the legs. Finally i screwed the cabnet sliders into the outside box. This made it so that the table could be lifed up with my hands, but had no way to move automaticly. I solved this with some linear actuators. I also bought a three way switch, 12v AC to DC converter, and a speed contoller because one of the motors was alot faster than the other. The fact that one was faster than the other ended up being a super big problem becuase the speed controller could not have the input polarity reverced. The way I had the Wireing done the polarity was reverced before the speed controller. Which the speeed controller would not allow. I also cant put the three way switch after the speed controller because theere are only two input terminals on the switch. The price for this was already getting high, so I did not want to buy a new speed controller. This caused me to take a break from the projcet, of about two years, in that time I got a standing desk off of amazon. Later during 2022 i wanted to revisit the project not because i needed the desk, but befause i needed the wireing expericance. After buying some relays from microcenter and grabbing an ardiuno I already had i was ready to go. I wired it up so that the ardiuno could controller the two motors and thier polarity. I than 3d printed a case for the whole thing and put it on the bottom of the desk. IT WORKED.",
    "github" : "",
    "imgurl" : "https://firebasestorage.googleapis.com/v0/b/portfolio-dedd9.appspot.com/o/bbbb3abd-8004-4fb8-ab88-28d50192cdee?alt=media&token=b5ccd472-2ecc-4173-a212-f6b3e6ea1555",
    "title" : "Standing desk made with ardiuno, and two channel relays.",
    "tldr" : "This standing desk was made over the course of two years. At first there was a polarity problem which caused it to not be able to be made with the current items. A year latter i revisited the project and with the help of an ardiuno and some two channel relays I was able to make a working standing desk. This was a verry fun project during the end when i had gathered the knolage i needed to compleate the standing desk. Sourse code is to the ardiuno code and the live demo is to a youtube video of it working.",
    "livedemo" : "https://youtu.be/bDInQ_gYR24"
}