{
    "datemade" : "7/19/22",
    "description": "I wanted to create a way to share my coding achievements. So I created a blog so that I could post different thanks I built. The blog was built using node.js and express to get data to the frontend and make it reactive. This worked well, but it's not a perfect solution as it was hard to deploy and it was never finally pushed into production. I initially created it using mongo DB, but as it did not work out with deployment I had to switch over to using MySQL which was not intended for this project as a relational database is a lot different than MongoDB. The main page looked nice and it was made using pure HTML and CSS and using express to make it reactive. This project taught me a lot about the deployment and production processes of apps and how different products and solutions work in different ways. I used this later to create my portfolio which was the better version of this. I had done previous Node.js stuff before so that is why I thought no Node.js would work, but in the end, no Node.js did not turn out to be a good solution for the project because deploying it was expensive and required a lot of maintenance. I wanted to continue working on other projects and was looking for a solution that required less maintenance so that is why you cannot find a live demo and why the MySQL database no longer exists. One of the problems I ran into was the Web hosting provider I was using was not great for this type of application. It was hard getting SSL certification and it made it hard to push the app into deployment. I did learn a lot about user authentication and encryption during this process even if some of the backend security measures were not all that secure.",
    "github" : "https://github.com/seesi8/blog",
    "imgurl" : "https://firebasestorage.googleapis.com/v0/b/portfolio-dedd9.appspot.com/o/979c29af-837e-4c11-881f-d823f4bb6e5c?alt=media&token=60940e23-864d-4ee2-b61c-e9d77b361655",
    "title": "Blog Made Using Node.js And Express, With MySQL database",
    "TLDR": "This Blog we made using node.js and express. The front was made purely of HTML and CSS. This project was a big learning experience in the deployment of applications. The database I used at first was MongoDB, but after starting deployment I changed to MySQL. There is no live demo because the app was never deployed becasue of maintenance, cost, and security.",
    "livedemo" : "https://samueldoes.dev/no"
}