{
    "datemade" : "2/18/21",
    "description" : "At the very start of the pandemic I started getting really into coding. The first project that started this coin journey was a dice probability calculator. I was playing DND and was amazed by how probability worked and how rolling dice probabilities worked. After reading about how probabilities worked I wanted an easy way to calculate them in my games of DND, so I decided to try to use a skill that I had not used in a while: Coding in python. I still remembered some of the basic syntaxes, and the basics of coding ( such as for and if loops), but did not know much. Luckily this was a fairly easy project and just required some simple computations. Some of the steppes were unnecessary such as finding all probabilities of the dice rolls and then counting how many times each occurrence happened. Instead, I could have just plugged in some formulas such as the one at this link: https://uploads-cdn.omnicalculator.com/images/dice_probability_exact_sum.gif. And repeated the calculation for each side of the dice. I did not do this though becasue even though that is what runs fastest on a computer that is not how humans think about probability. I coded the way that made sense, by calculating every single combination that could happen on the dice. I used this project in my life and it was a good starting project and taught my the fundamentals of coding and some math and probability.",
    "github" : "https://github.com/seesi8/dice",
    "imgurl" : "https://firebasestorage.googleapis.com/v0/b/portfolio-dedd9.appspot.com/o/b44d796a-9285-4ac8-9d5e-207c17673edf?alt=media&token=f80efd01-9f58-43db-9dc8-fe10192d7e8d",
    "title" : "dice projability calculator made with python",
    "tldr" : "Back in the early days of the pandemic I created a probability calculator using python. It was inspired by me playing DND which is a very dice-based game and relies a lot on probability. This is not made to be fast, but it was programmed as a way for me to be able to understand probability and learn about the fundamentals of coding. The livedemo is to a google colab of the code.",
    "livedemo" : "https://colab.research.google.com/drive/1qG7FMz3qjl2v8zOkIVL0jLCzx4rUEcY-?usp=sharing"
}


