{
    "datemade" : "7/24/21",
    "description" : "In the early pandemic along with coding I was playing alot of video games, namely minecraft. There was one server that I played on alot: Hypixel. It was a game that simulated a fanticy version of relaity were you levaled up and unlocked new weopens and powers. The game revolved around a in-game currency. This money could buy swords, bows, and all other types of fun things. You could sell and buy things on a action house. You could also buy items directly from people which tended to be more expensive than fighting for it in an auction. There were some extream examples of this were items would go for millions less than what they should have. Theese deals were hard to find though as the UI in the game did not have an easy way to sort this, so you had to manualy go through millions of pages. My idea: create a website were it showed underpriced autions and how much you could make by selling it derecly. The game had a very open and well made API. I used this api to first write a test version of this in python becasue i knew the language well and could make more complated programms than i could in Javascript like what was used in the browser. First I made an API call to the auctions to see the price of all items. I then checked all of theese items up againsed the price that the items were going for when you bought them directly ( data gotten from a second API call ). If there was a match I would Take the price that each was going for and calculated the differance. After this was writen i was able to translate it to javascript. Using the javascript object i was able to probogate the data to a html table. This was the only compleated feture of the website, but there was one other that the backend was made, but the frontend was never compleated. This feture being a bazaar (another in game marketplace used to sell commom goods such as food and raw materals such as iron or gold) flipper. The bazaar was a complacated shop. First You could create buy and sell orders. Theese were were you would place your items (incase of a sell order) or your money (incase of a buy order) and you could choose how much you wanted to buy or sell something for. There was also a way to buy and sell things instantly which would compeate the buy and sell orders at whatever they are willing to buy or sell for. This being said there was often a disparity from the price of creating a buy order and the price of creating a sell order. This was caused by people being eager to buy and sell things instantly even if the price is more than what the items are worth. The Simple way that then flipper worked was it would see the differance from the buy and sell orders and calcuate the profit, but it was not that simple. It was not this simple beacause the buy and sell costs could change, so buy the time that your buy order got filled the price for selling the item could have gone under what you bought it for. My solution was to plot the data on a graph and use an average trend over the last 5 orders to calcute were the price will be buy the time that the buy order was created. Then once you know what the price is in the future you can calcute an even more accurate profit prediction. The way I achived this was to create a backend node.js app and enter all of the data into a mysql database. Then when someone wanted to see what the best items to buy and sell were I would query the database and take that data then only view the last 5 order and see the slope that the are moving at based on the time and price. I would then take an everage that the price moves per second. I than took this data and multiplide it buy the time it would take to compleate  ( finding the time it took to compleate the order also took a database of how long it took to compleate each previosu order made and then take the time devided by the quantity to get the time per item. I would then multiply this by the quantity that you wanted to place the order for to get the most profit. )the order and then add this to the current price to get what the price is going to be in the future. I had all of this data in a backend server but I never setup the api to get it to the frontend.",
    "github" : "https://github.com/seesi8/Hytools",
    "imgurl" : "https://firebasestorage.googleapis.com/v0/b/portfolio-dedd9.appspot.com/o/5998f16f-1a88-4ebb-a7cc-41730cddc9cd?alt=media&token=626aa9dc-1aaa-4282-8cd5-d816f5a3de51",
    "title" : "Webstite that uses predictive modeling to find arbitrage in video game market that was built using pure js and html with a Node.js background",
    "tldr" : "This project was a tool made for a game I was playing called hypixel skyblock (which was a server inside of minecraft). I made this website using pure javascript and html with a acomponied html backend server that was used store data in a database. It used mysql as a backend. It also sued predictive modeling to track the price of in-game items in the furture. There was also a part of the website was used to find arbatrage between the auction market and the buy direct market. This feture was first layed out in python by making API request to the games API and then manipulated to find the differance in price between the two differant items. There was also a node.js background fo this website which was used to progogate the data used for the predictive modeling. It was a fun project maybe sometime in the future I will compleate other fetures. In the feture I would use react and a next.js backend becasue that would have made this project alot eisier, but I did not know about JS frameworks back then and used what limited web-dev knolage I knew. Source code is to the github. Sadly there is no live demo becasue it was not fully finished and is made for a developement build and it not ready for deployment. If you pull the github and open the index.html file it will work as expected.",
    "livedemo" : "samueldoesdev.no"
}