{
    "datemade" : "6/13/22",
    "description" : "Because i played alot of video games it seemed inevitable that i would want to code my own, so after a quick unity course i was able to understand at least the abseics of C#. This allowed me to be able to code a game in unity. As they were blowing up at the time i wanted to create my own mobile IDE game. I decided to make one of the type were you merge items to make it better and better for ever. I decided that I would make it so that you would merge pigs and they would upgrade in ability. First i created some semi decent sprite modeling for the background and for the pigs. I then created a c# script that made the pigs bounse around from wall to wall. Finaly for the pigs i made the ability for them to be dragged into each other and merge to the next level of pig. I also created some ui menues were you could buy some more pigs. This is when disaster struck. My computer crashed, and I had not fully saved the scene in weeks. This caused all of the UI modeling to go away. Luckely the scripts were still there, but this event would be enught to cause me to take a years break of unity. After the break I came back to this project. This time i was determined to finish it, and in just over a month i was able to complete 3 new ui models, new gameEvent scripts, and the ability to spend money to buy pigs. It was hard to figue out what was happening in the code, becasue at that point my coding was still not greate (not that it was at all perfect now either). I finaly got the project compleated and i continued on my next project, the standing desk. Some of the scripts I created for this project included creaet spawing scripts wich generated a unique position in the board. Merge scripts which searched for the next pigs in the prefab and spawned it. Also I nice looking momentum script which made the pigs bounce around the scene. There was also ways to dynamicly upgrade which pigs cost more than others. I finialy wrote my own custom cross paltfrom saving script so that the game would save between sessions. Sadly i was not able to publish to ios because of the apple developer age restriction, so i published it to the web. It is not made for the web so it does not look great.",
    "github" : "https://github.com/seesi8/mergePiggy",
    "imgurl" : "https://firebasestorage.googleapis.com/v0/b/portfolio-dedd9.appspot.com/o/304b08bd-e94f-433a-b9f0-bcc3a19aad89?alt=media&token=cccf1fde-59b0-4966-aef2-1286e0caca12",
    "title" : "Mobile game made with unity and C#: Merge Piggies",
    "tldr" : "I made my own mobile merge game with unity and custom c# scripts. It is cross platfrom and has a custom save script that way the game saves between save sessions. It tought my about the main ideas of OOP (object oriented programming) because even though some other langauges I was using included OOP I choose to create functional programming becasue it made more sence to me, but after this project I choose to do more of my work in an orject oriented manner. Sourse code is a zip because of github file size limit. Sadly i was not able to publish to ios because of the apple developer age restriction, so i published it to the web. It is not made for the web so it does not look great.",
    "livedemo" : "https://play.unity.com/mg/other/webgl-builds-233402"
}