{
   "datemade" : "7/19/22",
   "description" : "After learning how to use react I wanted to build something. I wanted to build something that I could use. I realized that I needed a portfolio to showcase the rest of my projects. I started by building the user authentication. Then moving onto the posts, then the contact page. The hardest part was relearning a technology that I had not used in a while. That being three.js. I used React-Three-Fiber which was more different than three.js then I would have thought. Using react three fiber I created a revolving model of all of the technologies I had used along my coding journey, Including: Python, Javascript, HTML, C#, Unity, and even building my own CNC mill. I spent time working on details that I thought did not look as good as they should which included adding a 3D text effect to the main headers, and adding a timeline to fill up extra empty space. I learned many errors and fundamentals about why some of the things that I was trying to do did not work with the frameworks I was using. I then pushed through and used different solutions such as the way that I did some styling on the page. I wanted to change the way that some pages looked when the page was vertical, but not all of this could be done in css. I ended up writing a function that figured out if it was vertical only to learn that react and next could not get the window width normally, so that took a workaround. One of the strangest errors I had was with the 3d text. When I resized the window the point at which the text changed to black was at the same height no matter the width, which caused the text to never fade out into black if the width was too small. In the end I used linear algebra to create a formula of values based on the height that made the text look normal. The final formula was blackPoint =  (0000003030303030303 * width) + 0.001195757575758. This was used to calculate when the text should turn black. This project was my very fun and useful.",
   "github" : "https://github.com/seesi8/portfolio",
   "imgurl" : "https://firebasestorage.googleapis.com/v0/b/portfolio-dedd9.appspot.com/o/9945c869-9345-43a3-bd6a-ad03cbed52b1?alt=media&token=a5fd128b-55ff-483c-bf78-51bb9d249cc1",
   "title" : "This Website: Made Using React, Node.js, and Firebase",
   "tldr" : "This project is the website you are currently on. I was made using React, Next.js, and Firebase. It took just over a week of active time working on It. It is fully reactive to work on mobile and other small devices. It has a contact me page (samueldoes.dev/contact), posts projects (samueldoes.dev/projects), and even an interactive 3d model (samueldoes.dev), All made with React. Source Code on the github, and you are currently seeing the live demo.",
   "livedemo" : "https://samueldoes.dev"
}
 
 

